[Killed] ConditionalExpression
services/cartService.js:80:9
       throw new Error('Item not found');
     }
 
-    if (cartItem.Product.inventory < quantity) {
+    if (true) {
       throw new Error('Not enough inventory available');
     }
killedBy: Cart Routes PUT /api/carts/:cartId/items/:itemId should update quantity to item
statusReason: Error: expected 200 "OK", got 400 "Bad Request"

[Killed] BooleanLiteral
services/cartService.js:91:9
 
   static async removeCartItem(itemId) {
     const cartItem = await CartItem.findByPk(itemId);
-    if (!cartItem) {
+    if (cartItem) {
       throw new Error('Item not found');
     }
killedBy: Cart Routes delete /api/carts/:cartId/items/:itemId should delete item to cart
statusReason: Error: expected 204 "No Content", got 400 "Bad Request"
